#language: ru

@tree
@ДокументыПродажи

Функционал: проверка документа Продажа

Как Тестировщик я хочу
проверить работу документа Продажа 
чтобы у пользователей не возникло трудностей   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: проверка документа Продажа

	* Открытие формы создания документа Продажа

		И В командном интерфейсе я выбираю 'Продажи' 'Документы продаж'
		И я нажимаю на кнопку с именем 'ФормаСоздатьПоПараметруРасходТовара'

	* Заполнение шапки документа

		И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "Все для дома"'
		//И из выпадающего списка с именем "Покупатель" я выбираю точное значение 'Животноводство ООО '
		И я нажимаю кнопку выбора у поля с именем 'Покупатель'
		Тогда открылось окно "Контрагенты"
		И в таблице 'Список' я перехожу на один уровень вниз				
		И в таблице 'Список' я перехожу к строке:
			| "Код"       | "Наименование"              |
			| "000000014" | 'Магазин "Бытовая техника"' |
		И в таблице 'Список' я выбираю текущую строку		
		И из выпадающего списка с именем "Склад" я выбираю точное значение 'Склад отдела продаж'
		И из выпадающего списка с именем "Валюта" я выбираю точное значение 'Рубли'

	* Заполнение 1 строки в табличной части Товары

		И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
		И я нажимаю на кнопку с именем 'ФормаСписок'		
		И в таблице "Список" я перехожу к строке:
			| 'Наименование' |
			| 'Торт '        |
		И в таблице "Список" я выбираю текущую строку
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "23,00"		
		И в таблице "Товары" я завершаю редактирование строки

	* Заполнение 2 строки в табличной части Товары

		И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
		И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
		И я нажимаю на кнопку с именем 'ФормаСписок'		
		И в таблице "Список" я перехожу к строке:
			| 'Наименование' |
			| 'Sony К3456P'        |
		И в таблице "Список" я выбираю текущую строку
		И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "2 500,00"			
		И в таблице 'Товары' в поле с именем 'ТоварыКоличество' я ввожу текст "11,00"		
		И в таблице "Товары" я завершаю редактирование строки

	* Заполнение вкладки Прочее

		И я перехожу к закладке с именем "Прочее"
		И в поле с именем 'ОбоснованиеОтгрузки' я ввожу текст 'Отгрузка товаров в рамках теста для финального задания Кислицин Иван'

	* Проведение документа

		И я нажимаю на кнопку с именем 'ФормаПровести'

	* Проверка движений документа по регистру Регистр взаиморасчетов с контрагентами

		И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр взаиморасчетов с контрагентами'
		Тогда таблица "Список" стала равной по шаблону:
			| 'Период' | 'Регистратор' | 'Номер строки' | 'Контрагент'                | 'Сумма'     | 'Валюта' |
			| '*'      | '*'           | '1'            | 'Магазин "Бытовая техника"' | '33 250,00' | 'Рубли'  |

	* Проверка движений документа по регистру Регистр продаж

		И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр продаж'
		Тогда таблица "Список" стала равной по шаблону:
			| 'Период' | 'Регистратор' | 'Номер строки' | 'Покупатель'                | 'Товар'       | 'Количество' | 'Сумма'     |
			| '*'      | '*'           | '1'            | 'Магазин "Бытовая техника"' | 'Торт '       | '23,00'      | '5 750,00'  |
			| '*'      | '*'           | '2'            | 'Магазин "Бытовая техника"' | 'Sony К3456P' | '11,00'      | '27 500,00' |
		
	* Проверка движений документа по регистру Регистр товарных запасов

		И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр товарных запасов'
		Тогда таблица "Список" стала равной по шаблону:
			| 'Период' | 'Регистратор' | 'Номер строки' | 'Товар'       | 'Склад'               | 'Количество' |
			| '*'      | '*'           | '1'            | 'Торт '       | 'Склад отдела продаж' | '23,00'      |
			| '*'      | '*'           | '2'            | 'Sony К3456P' | 'Склад отдела продаж' | '11,00'      |
		
	* Проверка печатной формы

		И в текущем окне я нажимаю кнопку командного интерфейса 'Основное'
		И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
		И табличный документ "SpreadsheetDocument" содержит строки из макета "РасходнаяНакладная" по шаблону

	* Закрытие всех окон

		И я закрываю все окна клиентского приложения